app/Http/Controllers/PageController.php

    public function __construct()
    {
        view()->composer('*', function (View $view) {
            $unit = session('unit');
            $website_setting = Setting::whereHas('unit', function ($query) use ($unit) {
                $query->where('slug', $unit);
            })->first();
            $website_menus = Menu::whereNull('parent_id')->whereHas('unit', function ($query) use ($unit) {
                $query->where('slug', $unit);
            })->where('is_active', 1)->whereRaw("FIND_IN_SET(0, menu_type)")->orderBy('position','ASC')->get();
            $footer_menus = Menu::whereNull('parent_id')->whereHas('unit', function ($query) use ($unit) {
                $query->where('slug', $unit);
            })->orderBy('position','ASC')->where('is_active', 1)->whereRaw("FIND_IN_SET(1, menu_type)")->get();
            $UnitWiseSectionPermission = Section::select('slug')->whereHas('unit', function($q) use($unit) {
                $q->where('slug', $unit);
            })->where('is_active',1)->get()->pluck('slug')->toArray();
---
select * from `settings` where exists (select * from `units` where `settings`.`unit_id` = `units`.`id` and `slug` = 'main' and `units`.`deleted_at` is null) limit 1
select * from `menus` where `parent_id` is null and exists (select * from `units` where `menus`.`unit_id` = `units`.`id` and `slug` = 'main' and `units`.`deleted_at` is null) and `is_active` = 1 and FIND_IN_SET(0, menu_type) and `menus`.`deleted_at` is null order by `position` asc
select * from `menus` where `parent_id` is null and exists (select * from `units` where `menus`.`unit_id` = `units`.`id` and `slug` = 'main' and `units`.`deleted_at` is null) and `is_active` = 1 and FIND_IN_SET(1, menu_type) and `menus`.`deleted_at` is null order by `position` asc
select `slug` from `sections` where exists (select * from `units` where `sections`.`unit_id` = `units`.`id` and `slug` = 'main' and `units`.`deleted_at` is null) and `is_active` = 1 and `sections`.`deleted_at` is null

    public function show(...$segments)
    {
        $segments = array_values(array_filter($segments, function($v) { return $v !== null && $v !== ''; }));
        if (isset($segments[2]) && strpos($segments[2], '/') !== false) {
            $parts = explode('/', $segments[2], 2);
            unset($segments[2]);
            array_splice($segments, 2, 0, $parts);
        }

        if (count($segments) < 3) {
            abort(404);
        }

        $lang = $segments[0] ?? 0;
        $unit = $segments[1] ?? 0;
        $slug1 = $segments[2] ?? 0;
        $slug2 = $segments[3] ?? null;
        $all_sub_menu = [];

        if($slug1 != null && $slug2 != null){
            $parent_menu = Menu::where('slug', $slug1)->whereHas('unit',function($query) use($unit){
                $query->where('slug', $unit);
            })->where('is_active',1)->first();

            $child_menu = Menu::where('parent_id', $parent_menu->id)->where('slug', $slug2)->whereHas('unit',function($query) use($unit){
                $query->where('slug', $unit);
            })->where('is_active',1)->first();
            $mainmenuslug = $parent_menu->slug ?? '';
            $all_sub_menu = Menu::where('parent_id', $parent_menu?->id)->orderBy('position','ASC')->whereHas('unit', function ($query) use ($unit) {
                    $query->where('slug', $unit);
                })->where('is_active', 1)->whereRaw("FIND_IN_SET(0, menu_type)")->get();
---
select * from `menus` where `slug` = 'iofs-officer' and exists (select * from `units` where `menus`.`unit_id` = `units`.`id` and `slug` = 'main' and `units`.`deleted_at` is null) and `is_active` = 1 and `menus`.`deleted_at` is null limit 1
select * from `menus` where `parent_id` = 22 and `slug` = 'iofs-officers-list' and exists (select * from `units` where `menus`.`unit_id` = `units`.`id` and `slug` = 'main' and `units`.`deleted_at` is null) and `is_active` = 1 and `menus`.`deleted_at` is null limit 1
select * from `menus` where `parent_id` = 22 and exists (select * from `units` where `menus`.`unit_id` = `units`.`id` and `slug` = 'main' and `units`.`deleted_at` is null) and `is_active` = 1 and FIND_IN_SET(0, menu_type) and `menus`.`deleted_at` is null order by `position` asc

            $main_menu = $parent_menu;
        }elseif($slug1 != null && $slug2 == null){
            $slug = $slug1;
            $menu = Menu::where('slug', $slug)->whereHas('unit',function($query) use($unit){
                $query->where('slug', $unit);
            })->where('is_active',1)->first();
---
select * from `menus` where `slug` = 'home' and exists (select * from `units` where `menus`.`unit_id` = `units`.`id` and `slug` = 'main' and `units`.`deleted_at` is null) and `is_active` = 1 and `menus`.`deleted_at` is null limit 1

        }else{
             abort(404);
        }
        $unit_id = Unit::where('is_active',1)->where('slug', $unit)->first()->id;
---
select * from `units` where `is_active` = 1 and `slug` = 'main' and `units`.`deleted_at` is null limit 1

        }
         $page = '';
        if($menu->extend_to != null){
            $Extendedmenu = Templete::where('id', $menu->extend_to)->first();
---
select * from `templetes` where `id` = 1 limit 1

    public function home($unit_id,$menu_id){
        $today = date('Y-m-d');
        $banners = Banner::where('publish_date','<=',$today)->where('unit_id',$unit_id)->where(function($query) use($today){
            $query->where('expire_date','>=',$today)->orwhere('expire_date',null);
        })->where('is_active',1)->orderBy('possition','ASC')->get();
---
select * from `banners` where `publish_date` <= '2025-09-16' and `unit_id` = 1 and (`expire_date` >= '2025-09-16' or `expire_date` is null) and `is_active` = 1 and `banners`.`deleted_at` is null order by `possition` asc

        })->where('is_active',1)->orderBy('position','ASC')->latest()->take(4)->get();


        $recent_documents = Document::where('is_archived',0)->where('menu_id',$menu_id)->where('unit_id',$unit_id)->where('is_active',1)->orderBy('position','ASC')->latest()->take(4)->get();
---
select * from `documents` where `is_archived` = 0 and `menu_id` = 1 and `unit_id` = 1 and `is_active` = 1 and `documents`.`deleted_at` is null order by `position` asc, `created_at` desc limit 4

            $query->where('slug','announcements');
        })->orderBy('position','ASC')->where('is_active',1)->latest()->get();

        $hod_details = Hod::where('unit_id',$unit_id)->where('is_active',1)->where('from_date','<=',date('Y-m-d'))->where('to_date','>=',date('Y-m-d'))->latest()->first();
---
select * from `hods` where `unit_id` = 1 and `is_active` = 1 and `from_date` <= '2025-09-16' and `to_date` >= '2025-09-16' and `hods`.`deleted_at` is null order by `created_at` desc limit 1

           $q->where('id',13);
        })->where('unit_id',$unit_id)->where('is_active',1)->orderBy('id','asc')->latest()->orderBy('position','ASC')->take(4)->get();

        $tenders = Document::where('is_archived',0)->whereHas('menu',function($q){
           $q->where('id',14);
        })->where('unit_id',$unit_id)->where('is_active',1)->orderBy('position','ASC')->orderBy('position','ASC')->latest()->take(4)->get();

        $vacancies = Document::where('is_archived',0)->whereHas('menu',function($q){
           $q->where('id',15);
        })->where('unit_id',$unit_id)->orderBy('position','ASC')->where('is_active',1)->orderBy('position','ASC')->latest()->take(4)->get();
---
select * from `documents` where `is_archived` = 0 and exists (select * from `menus` where `documents`.`menu_id` = `menus`.`id` and `id` = 14 and `menus`.`deleted_at` is null) and `unit_id` = 1 and `is_active` = 1 and `documents`.`deleted_at` is null order by `position` asc, `position` asc, `created_at` desc limit 4
select * from `documents` where `is_archived` = 0 and exists (select * from `menus` where `documents`.`menu_id` = `menus`.`id` and `id` = 15 and `menus`.`deleted_at` is null) and `unit_id` = 1 and `is_active` = 1 and `documents`.`deleted_at` is null order by `position` asc, `position` asc, `created_at` desc limit 4

    public function iofs_officers_list($unit_id,$menu_id)
    {
        $search = request()->query('search');
        $grade = request()->query('grade');
        $unit = request()->query('unit');
        $per_page = request()->query('per_page') ?? 10;

        $iofs_officers = Aipr::where('unit_id', $unit_id)->where('menu_id', $menu_id)
        ->when($search, function ($query, $search) {
            $query->where('name', 'like', '%' . $search . '%')->orwhere('unit', 'like', '%' . $search . '%')->orwhere('grade', 'like', '%' . $search . '%')->orwhere('doj_iofs', 'like', '%' . $search . '%');
        })
        ->when($grade, function ($query, $grade) {
            $query->where('grade', $grade);
        })
        ->when($unit, function ($query, $unit) {
            $query->where('unit', $unit);
        })
        ->where('is_active', 1)->paginate($per_page);
        $grades = Aipr::where('unit_id', $unit_id)->where('menu_id', $menu_id)->where('is_active', 1)->pluck('grade')->unique();
        $units = Aipr::where('unit_id', $unit_id)->where('menu_id', $menu_id)->where('is_active', 1)->pluck('unit')->unique();
---
select `grade` from `aiprs` where `unit_id` = 1 and `menu_id` = 23 and `is_active` = 1 and `aiprs`.`deleted_at` is null
select `unit` from `aiprs` where `unit_id` = 1 and `menu_id` = 23 and `is_active` = 1 and `aiprs`.`deleted_at` is null