app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `users` where `is_active` = 1 and `users`.`deleted_at` is null
select count(*) as aggregate from `units` where `is_active` = 1 and `units`.`deleted_at` is null
select count(*) as aggregate from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and `slug` = 'content-approver' and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and `slug` = 'content-reviewer' and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and `slug` = 'unit-wise-admin-user' and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
---
    public function dashboard()
    {
        if(auth()->user()->can('specific-unit')){
            $total_user = User::where('is_active',1)->where('unit_id',Auth::user()->unit_id)->count();
            $total_unit = Unit::where('is_active',1)->count() - 1;
            $total_approvers = User::where('unit_id',auth()->user()->unit_id)->whereHas('roles', function ($query) { $query->where('slug', 'content-approver'); })->where('is_active',1)->count();
            $total_reviewers = User::where('unit_id',auth()->user()->unit_id)->whereHas('roles', function ($query) { $query->where('slug', 'content-reviewer'); })->where('is_active',1)->count();
            $total_unit_admin = User::where('unit_id',auth()->user()->unit_id)->whereHas('roles', function ($query) { $query->where('slug', 'unit-wise-admin-user'); })->where('is_active',1)->count();
        }
        else{
            $total_user = User::where('is_active',1)->count();
            $total_unit = Unit::where('is_active',1)->count() - 1;
            $total_approvers = User::whereHas('roles', function ($query) { $query->where('slug', 'content-approver'); })->where('is_active',1)->count();
            $total_reviewers = User::whereHas('roles', function ($query) { $query->where('slug', 'content-reviewer'); })->where('is_active',1)->count();
            $total_unit_admin = User::whereHas('roles', function ($query) { $query->where('slug', 'unit-wise-admin-user'); })->where('is_active',1)->count();