app/Http/Controllers/Admin/AuthController.php

select * from `users` where `email` = 'iamabackenddeveloper@gmail.com' and `is_active` = 1 and `users`.`deleted_at` is null limit 1
---
    public function login(Request $request)
    {
        if ($request->post()) {
            $request->validate([
                'email' => 'required|email:rfc,dns|exists:users,email',
                'password' => [
                    'required',
                    'string',
                    'min:8',
                    'regex:/[a-z]/',      // at least one lowercase letter
                    'regex:/[A-Z]/',      // at least one uppercase letter
                    'regex:/[0-9]/',      // at least one digit
                    'regex:/[@$!%*#?&]/', // at least one special character
                ],
                // 'captcha'  => 'required' // <-- captcha validation
                // ], [
                //     'captcha.captcha' => 'Invalid captcha code.' // custom error
                ]);


            $user_status = User::where('email', $request->email)->where('is_active', 1)->first();

select * from `users` where `email` = 'iamabackenddeveloper@gmail.com' and `users`.`deleted_at` is null limit 1
---
    public function otp_verification(Request $request)
    {
        if ($request->post()) {

            $request->validate([
                'otp' => 'required|digits:6',
                'email' => 'required',
                // 'captcha'  => 'required' // <-- captcha validation
                // ], [
                //     'captcha.captcha' => 'Invalid captcha code.' // custom error
                ]);
            $email = base64_decode($request->email);
            $user = User::where('email', $email)
                ->first();