app/Http/Controllers/Admin/CmsController.php

select * from `units` where `is_active` = 1 and `units`.`deleted_at` is null
select * from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and exists (select * from `permissions` inner join `roles_permissions` on `permissions`.`id` = `roles_permissions`.`permission_id` where `roles`.`id` = `roles_permissions`.`role_id` and `slug` in ('add-edit-all-content-details', 'add-edit-english-content-details') and `permissions`.`deleted_at` is null) and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
select * from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and exists (select * from `permissions` inner join `roles_permissions` on `permissions`.`id` = `roles_permissions`.`permission_id` where `roles`.`id` = `roles_permissions`.`role_id` and `slug` in ('add-edit-all-content-details', 'add-edit-hindi-content-details') and `permissions`.`deleted_at` is null) and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
select * from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and exists (select * from `permissions` inner join `roles_permissions` on `permissions`.`id` = `roles_permissions`.`permission_id` where `roles`.`id` = `roles_permissions`.`role_id` and `slug` = 'content-approve-review' and `permissions`.`deleted_at` is null) and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
---
                });
            })->where('is_active', 1)->get();
        } else {
            $units  = Unit::where('is_active', 1)->get();
            $en_contant_writters = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                   $q->whereIn('slug', ['add-edit-all-content-details','add-edit-english-content-details']);
                });
            })->where('is_active', 1)->get();
            $hi_contant_writters = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                   $q->whereIn('slug', ['add-edit-all-content-details','add-edit-hindi-content-details']);
                });
            })->where('is_active', 1)->get();
            $contant_approvers = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                    $q->where('slug', 'content-approve-review');
                });
            })->where('is_active', 1)->get();
            $contant_reviewers = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                    $q->where('slug', 'content-approve-review');
                });
            })->where('is_active', 1)->get();
            $hindi_contant_approvers = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                    $q->where('slug', 'content-approve-review');
                });
            })->where('is_active', 1)->get();
            $hindi_contant_reviewers = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                    $q->where('slug', 'content-approve-review');
                });
            })->where('is_active', 1)->get();

select * from `units` where `is_active` = 1 and `units`.`deleted_at` is null
select * from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and exists (select * from `permissions` inner join `roles_permissions` on `permissions`.`id` = `roles_permissions`.`permission_id` where `roles`.`id` = `roles_permissions`.`role_id` and `slug` in ('add-edit-all-content-details', 'add-edit-english-content-details') and `permissions`.`deleted_at` is null) and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
select * from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and exists (select * from `permissions` inner join `roles_permissions` on `permissions`.`id` = `roles_permissions`.`permission_id` where `roles`.`id` = `roles_permissions`.`role_id` and `slug` in ('add-edit-all-content-details', 'add-edit-hindi-content-details') and `permissions`.`deleted_at` is null) and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
select * from `users` where exists (select * from `roles` inner join `users_roles` on `roles`.`id` = `users_roles`.`role_id` where `users`.`id` = `users_roles`.`user_id` and exists (select * from `permissions` inner join `roles_permissions` on `permissions`.`id` = `roles_permissions`.`permission_id` where `roles`.`id` = `roles_permissions`.`role_id` and `slug` = 'content-approve-review' and `permissions`.`deleted_at` is null) and `roles`.`deleted_at` is null) and `is_active` = 1 and `users`.`deleted_at` is null
---
                });
            })->where('is_active', 1)->get();
        } else {
            $units  = Unit::where('is_active', 1)->get();
            $en_contant_writters = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                   $q->whereIn('slug', ['add-edit-all-content-details','add-edit-english-content-details']);
                });
            })->where('is_active', 1)->get();
            $hi_contant_writters = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                   $q->whereIn('slug', ['add-edit-all-content-details','add-edit-hindi-content-details']);
                });
            })->where('is_active', 1)->get();
            $contant_approvers = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                    $q->where('slug', 'content-approve-review');
                });
            })->where('is_active', 1)->get();
            $contant_reviewers = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                    $q->where('slug', 'content-approve-review');
                });
            })->where('is_active', 1)->get();
            $hindi_contant_approvers = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                    $q->where('slug', 'content-approve-review');
                });
            })->where('is_active', 1)->get();
            $hindi_contant_reviewers = User::whereHas('roles', function ($query) {
                $query->whereHas('permissions', function ($q) {
                    $q->where('slug', 'content-approve-review');
                });
            })->where('is_active', 1)->get();

select `id`, `title` from `sections` where `menu_id` = '5' and `is_active` = 1 and `sections`.`deleted_at` is null
---
    public function getSections($menu_id)
    {
        $sections = Section::where('menu_id', $menu_id)->where('is_active', 1)->select('id', 'title')->get();